app/repositories/authors_repository.rb

SELECT "authors".* FROM "authors"
---
  def initialize(relation = Author.all)