app/repositories/books_repository.rb

  def initialize(relation = Book.all)
---
SELECT "books".* FROM "books"