app/repositories/categories_repository.rb

  def initialize(relation = Category.all)
---
SELECT "categories".* FROM "categories"