app/repositories/loans_repository.rb

  def initialize(relation = Loan.all)
---
SELECT "loans".* FROM "loans"