app/repositories/reservations_repository.rb

SELECT "reservations".* FROM "reservations"
---
  def initialize(relation = Reservation.all)