app/repositories/users_repository.rb

  def initialize(relation = User.all)
---
SELECT "users".* FROM "users"